/*
 Localizable.strings
 CSResourceFork
 
 Created by Charles Srstka on 2/19/12.
 Copyright (c) 2012 __MyCompanyName__. All rights reserved.
 */

"Yes" = "Oui";
"No" = "Non";

"Error" = "Erreur";
"Warning" = "Attention";

"NOT_RSRC_FILE" = "Le fichier \"%@\" n’est pas un fichier de ressources.";
"UNKNOWN_ERROR" = "Erreur inconnue !";

"FORK_READ_ERROR" = "Erruer dans la lecture des données de la fourche ressources %d.";
"FORK_WRITE_ERROR" = "Erruer dans l’écriture des données de la fourche ressources %d.";

"NOT_A_READ_HANDLE" = "Cepointeur au fichier n’est pas en mesure de lire les données.";
"NOT_A_WRITE_HANDLE" = "Ce pointeur au fichier n’est pas en mesure d’écrire les données.";

"RES_TOO_LARGE" = "La taille de ID ‘%@’ est de %d octets lus, mais une ressource ne peut pas avoir une taille plus grande que %lu octets.";
"RES_DATA_TOO_LARGE" = "La taille combinée des ressources dans ce fichier de ressources dépasse %lu octets, ce qui est interdit.";

"TOO_MANY_TYPES" = "Un fichier de ressources ne peut pas contenir plus de %lu types de ressources.";

"TYPE_LIST_OFFSET_TOO_LARGE" = "Le décalage de la liste de type de ressource est %lu, mais le maximum est %lu.";
"NAME_LIST_OFFSET_TOO_LARGE" = "Le décalage de la liste de nom de ressource est %lu, mais le maximum est %lu.";
"RES_NAME_OFFSET_TOO_LARGE" = "Le décalage pour le nom de la ressource '%@' ID %d est trop grande; le maximum est %lu.";
"RES_DATA_OFFSET_TOO_LARGE" = "Le décalage pour les données ressource de '%@' ID %d est trop grande; le maximum est %lu.";
"REF_LIST_TOO_LONG" = "La liste de référence pour le type '%@' est trop longue; elle doit être plus courte que %lu octets.";
"TOO_MANY_RESOURCES" = "Trop de ressources de type '%@'; le maximum est %lu.";

"INVALID_RESOURCE_TYPE" = "Invalid type de ressource ‘%@’.";
"INVALID_RESOURCE_ID" = "Invalid ID de ressource %ld; seules les valeurs de %d à %d sont autorisées.";

"RES_DATA_NOT_FOUND" = "Impossible de trouver les données de ressources pour '%@' ID %d.";

"RES_ALREADY_EXISTS" = "Une ressource existe déjà avec le type '%@' et ID %d.";
"RES_NOT_FOUND" = "Type de ressource '%@' %d est introuvable.";

"FORK_ALREADY_EXISTS" = "La fourche spécifiée existe déjà.";
"FORK_NOT_FOUND" = "La fourche spécifiée n’existe pas.";

"XATTR_NOT_FOUND" = "L'attribut étendu « %@ » ne semble pas exister.";
"XATTR_ALREADY_EXISTS" = "Un attribut étendu avec le nom « %@ » existe déjà.";

"INVALID_HFS_TYPE" = "Type invalide « %@ ». ";
"INVALID_CREATOR" = "Créateur invalide « %@ ».";

"DATA_FORK_NOT_SUPPORTED" = "Le fichier \"%@\" ne gère pas la fourchette de données.";
"RSRC_FORK_NOT_SUPPORTED" = "Le fichier \"%@\" ne gère pas la fourche de ressources.";
"XATTRS_NOT_SUPPORTED" = "Le fichier \"%@\" ne gère pas les attributs étendus.";
"SPECIAL_XATTR_NOT_SUPPORTED" = "Désolé, l’attribut spécial long « %@ » ne peut pas être gérée.";
"SPECIAL_XATTR_CANNOT_BE_RENAMED" = "Désolé, l’attribut spécial long « %@ » ne peut pas être renommé.";

"UID_NOT_FOUND" = "Aucun utilisateur existant avec ID %lu.";
"USER_NAME_NOT_FOUND" = "Aucun utilisateur existant avec le nom «%@».";

"GID_NOT_FOUND" = "Aucun groupe existant avec ID %lu.";
"GROUP_NAME_NOT_FOUND" = "Aucun groupe existant avec le nom «%@».";

// ACL stuff

"User" = "utilisateur";
"Group" = "uroup";
"Unknown" = "inconnu";

"allow" = "permettre";
"deny" = "refuser";

"ACL_READ_DATA" = "lecture";
"ACL_LIST_DIRECTORY" = "liste";
"ACL_WRITE_DATA" = "écriture";
"ACL_ADD_FILE" = "add_file";
"ACL_EXECUTE" = "exécution";
"ACL_SEARCH" = "recherche";
"ACL_DELETE" = "suppression";
"ACL_APPEND_DATA" = "append";
"ACL_ADD_SUBDIRECTORY" = "add_subdirectory";
"ACL_DELETE_CHILD" = "delete_child";
"ACL_READ_ATTRIBUTES" = "readattr";
"ACL_WRITE_ATTRIBUTES" = "writeattr";
"ACL_READ_EXTATTRIBUTES" = "readextattr";
"ACL_WRITE_EXTATTRIBUTES" = "writeextattr";
"ACL_READ_SECURITY" = "readsecurity";
"ACL_WRITE_SECURITY" = "writesecurity";
"ACL_CHANGE_OWNER" = "chown";

"ACL_FILE_INHERIT" = "file_inherit";
"ACL_DIRECTORY_INHERIT" = "directory_inherit";
"ACL_LIMIT_INHERIT" = "limit_inherit";
"ACL_ONLY_INHERIT" = "only_inherit";

"ACL_PERM_SEPARATOR" = ", ";